Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/atdf/PIC32CM1216LS00032.atdf
        <module name="FPB" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="4" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" name2="U2257" version="2.2.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="5" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="6" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for FREQM"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" name2="U2122" version="1.1.2">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="1" function="H" pad="PA23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="2" function="H" pad="PA22"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="3"/>
              <param name="GEN_NUM" value="5" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="4" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8" caption="Number of Generic Clock Sources - 1"/>
              <param name="NUM" value="35" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="9" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="7" caption="Instance index for GCLK"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" id="SYSTEM_IP" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
          </instance>
          <instance name="ICB_NS">
            <register-group name="ICB_NS" name-in-module="ICB" address-space="base" offset="0xE002E000"/>
          </instance>
        </module>
        <module name="IDAU" id="sec_idau_u2803_v2" name2="sec_idau_u2803_v2" version="2a0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="CRYA_AES_DEC_ADDR" value="0x02006808" caption="crya_aes_dec function address"/>
              <param name="CRYA_AES_ENC_ADDR" value="0x02006804" caption="crya_aes_enc function address"/>
              <param name="CRYA_GF_MULT128_ADDR" value="0x0200680C" caption="crya_gf_mult128 function address"/>
              <param name="CRYA_SHA_PROCESS_ADDR" value="0x02006800" caption="crya_sha_process function address"/>
              <param name="CRYA_SHA256_FINAL_ADDR" value="0x02006818" caption="crya_sha256_final function address"/>
              <param name="CRYA_SHA256_INIT_ADDR" value="0x02006810" caption="crya_sha256_init function address"/>
              <param name="CRYA_SHA256_UPDATE_ADDR" value="0x02006814" caption="crya_sha256_update function address"/>
              <param name="GRANULARITY_ANSC" value="0x20" caption="Application Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_AS" value="0x100" caption="Application Secure region granularity"/>
              <param name="GRANULARITY_BNSC" value="0x20" caption="Boot Flash Non-Secure Callable region granularity"/>
              <param name="GRANULARITY_BOOTPROT" value="0x100" caption="BOOTPROT region granularity"/>
              <param name="GRANULARITY_BS" value="0x100" caption="Boot Flash Secure region granularity"/>
              <param name="GRANULARITY_DS" value="0x100" caption="DS region granularity"/>
              <param name="GRANULARITY_RS" value="0x80" caption="RAM Secure region granularity"/>
              <param name="REGION_ANS" value="0x05" caption="Application Non-Secure region ID"/>
              <param name="REGION_ANSC" value="0x04" caption="Application Non-Secure Callable region ID"/>
              <param name="REGION_AS" value="0x03" caption="Application Secure region ID"/>
              <param name="REGION_BNSC" value="0x02" caption="Boot Flash Non-Secure Callable region ID"/>
              <param name="REGION_BOOTROM" value="0x08" caption="Boot ROM region ID"/>
              <param name="REGION_BS" value="0x01" caption="Boot Flash Secure region ID"/>
              <param name="REGION_DNS" value="0x07" caption="DATAFLASH Non-Secure region ID"/>
              <param name="REGION_DS" value="0x06" caption="DATAFLASH Secure region ID"/>
              <param name="REGION_IOBUS" value="0x00" caption="IOBUS region ID"/>
              <param name="REGION_OTHER" value="0x00" caption="Other region ID"/>
              <param name="REGION_PERIPHERALS" value="0x00" caption="Peripherals region ID"/>
              <param name="REGION_RNS" value="0x0A" caption="RAM Non-Secure region ID"/>
              <param name="REGION_RS" value="0x09" caption="RAM Secure region ID"/>
              <param name="INSTANCE_ID" value="32" caption="Instance index for IDAU"/>
            </parameters>
          </instance>
        </module>
