Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/atdf/PIC32CM1216LS00032.atdf
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE0" caption="Pin State of EXTINT0" mask="0x1"/>
          <bitfield name="PINSTATE1" caption="Pin State of EXTINT1" mask="0x2"/>
          <bitfield name="PINSTATE2" caption="Pin State of EXTINT2" mask="0x4"/>
          <bitfield name="PINSTATE3" caption="Pin State of EXTINT3" mask="0x8"/>
          <bitfield name="PINSTATE4" caption="Pin State of EXTINT4" mask="0x10"/>
          <bitfield name="PINSTATE5" caption="Pin State of EXTINT5" mask="0x20"/>
          <bitfield name="PINSTATE6" caption="Pin State of EXTINT6" mask="0x40"/>
          <bitfield name="PINSTATE7" caption="Pin State of EXTINT7" mask="0x80"/>
        </register>
        <register name="NSCHK" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="Non-secure Interrupt Check Enable">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Nonsecure Check Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Nonsecure Check Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Nonsecure Check Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Nonsecure Check Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Nonsecure Check Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Nonsecure Check Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Nonsecure Check Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Nonsecure Check Enable" mask="0x80"/>
          <bitfield name="NMI" caption="Non-Maskable External Interrupt Nonsecure Check Enable" mask="0x80000000"/>
        </register>
        <register name="NONSEC" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Non-secure Interrupt">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Nonsecure Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Nonsecure Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Nonsecure Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Nonsecure Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Nonsecure Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Nonsecure Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Nonsecure Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Nonsecure Enable" mask="0x80"/>
          <bitfield name="NMI" caption="Non-Maskable Interrupt Nonsecure Enable" mask="0x80000000"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMIASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_ASYNCH__ASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__PRESCALER">
        <value name="DIV2" caption="EIC clock divided by 2" value="0x0"/>
        <value name="DIV4" caption="EIC clock divided by 4" value="0x1"/>
        <value name="DIV8" caption="EIC clock divided by 8" value="0x2"/>
        <value name="DIV16" caption="EIC clock divided by 16" value="0x3"/>
        <value name="DIV32" caption="EIC clock divided by 32" value="0x4"/>
        <value name="DIV64" caption="EIC clock divided by 64" value="0x5"/>
        <value name="DIV128" caption="EIC clock divided by 128" value="0x6"/>
        <value name="DIV256" caption="EIC clock divided by 256" value="0x7"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__STATES">
        <value name="LFREQ3" caption="3 low frequency samples" value="0"/>
        <value name="LFREQ7" caption="7 low frequency samples" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__TICKON">
        <value name="CLK_GCLK_EIC" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_LFREQ" caption="Clocked by Low Frequency Clock" value="1"/>
      </value-group>
    </module>
    <module name="EVSYS" id="03601" version="2a1" caption="Event System Interface">
      <register-group name="CHANNEL" size="0x8">
        <register name="CHANNEL" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Channel n Control">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x3F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="CHINTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Disable" mask="0x2"/>
        </register>
        <register name="CHINTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Enable" mask="0x2"/>
        </register>
        <register name="CHINTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="OVR" caption="Channel Overrun" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x2"/>
        </register>
        <register name="CHSTATUS" offset="0x7" rw="R" size="1" initval="0x01" caption="Channel n Status">
          <bitfield name="RDYUSR" caption="Ready User" mask="0x1"/>
          <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2"/>
        </register>
      </register-group>
