Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/atdf/PIC32CM1216LS00032.atdf
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="5" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="35" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0x7" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Division by GENCTRLn.DIV" value="0x0"/>
        <value name="DIV2" caption="Division by 2^(GENCTRLn.DIV+1)" value="0x1"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad (GCLK_IO)" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="4"/>
        <value name="OSC16M" caption="OSC16M oscillator output" value="5"/>
        <value name="DFLLULP" caption="DFLLULP output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="FDPLL96M" caption="FDPLL96M output" value="8"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
      </value-group>
    </module>
    <module name="ICB" version="1.0.0" caption="Implementation Control Block">
      <register-group name="ICB" caption="Implementation Control Block">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="Interrupt line set number" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
        </register>
      </register-group>
    </module>
    <module name="IDAU" id="03710" version="2a0" caption="Implementation Defined Attribution Unit">
      <register-group name="IDAU" caption="Implementation Defined Attribution Unit">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="SECCTRL" offset="0x1" rw="RW" size="1" initval="0x03" caption="SECCTRL">
          <bitfield name="SCFGWEN" caption="Security Configuration Write Enable" mask="0x1"/>
          <bitfield name="RXN" caption="SRAM eXecute Never" mask="0x4"/>
        </register>
        <register name="SCFGB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="SCFGB">
          <bitfield name="BNSC" caption="Non-Secure Callable (NSC) Flash (BNSC region) size" mask="0xFF800"/>
          <bitfield name="BOOTPROT" caption="Secure Flash (BOOTPROT/BS region) size" mask="0x7FF00000"/>
        </register>
        <register name="SCFGA" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SCFGA">
          <bitfield name="AS" caption="Secure Flash (AS region) size" mask="0x7FF"/>
          <bitfield name="ANSC" caption="Non-Secure Callable (NSC) Flash (ANSC region) size" mask="0xFF800"/>
          <bitfield name="DS" caption="Secure Data Flash (DS region) size" mask="0x7F00000"/>
        </register>
        <register name="SCFGR" offset="0xC" rw="RW" size="2" initval="0x0000" caption="SCFGR">
          <bitfield name="RS" caption="Secure SRAM (RS region) Size" mask="0x1FF"/>
        </register>
      </register-group>
    </module>
    <module name="MCLK" id="U2234" version="3.1.0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="CKSEL" caption="Clock Select" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x00003FFF" caption="AHB Mask">
          <bitfield name="APBA_" caption="APBA AHB Clock Mask" mask="0x1"/>
          <bitfield name="APBB_" caption="APBB AHB Clock Mask" mask="0x2"/>
          <bitfield name="APBC_" caption="APBC AHB Clock Mask" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x8"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS AHB Clock Mask" mask="0x20"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x40"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x80"/>
          <bitfield name="TRAM_" caption="TRAM AHB Clock Mask" mask="0x1000"/>
          <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x2000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00007FFF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x1000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x2000"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000037" caption="APBB Mask">
          <bitfield name="IDAU_" caption="IDAU APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Clock Enable" mask="0x10"/>
          <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x20"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x0017C38F" caption="APBC Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x8"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x80"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x100"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x200"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x4000"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x8000"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x20000"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x40000"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Clock Enable" mask="0x100000"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="MPU_TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instructions and data address regions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of MPU data regions" mask="0xFF00"/>
        </register>
        <register name="MPU_CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="HardFault, NMI enable" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Privileged default enable" mask="0x4"/>
        </register>
        <register name="MPU_RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Selected region number" mask="0xFF"/>
        </register>
        <register name="MPU_RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="MPU_RBAR__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="MPU_RBAR__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="MPU_RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Limit Address Register">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
