Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/atdf/PIC32CM1216LS00032.atdf
        <register name="BOCOR_WORD_24" offset="0x60" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 24">
          <bitfield name="BOOTROM_BOOTKEY_4" caption="Secure Boot Key bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_25" offset="0x64" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 25">
          <bitfield name="BOOTROM_BOOTKEY_5" caption="Secure Boot Key bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_26" offset="0x68" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 26">
          <bitfield name="BOOTROM_BOOTKEY_6" caption="Secure Boot Key bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_27" offset="0x6C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 27">
          <bitfield name="BOOTROM_BOOTKEY_7" caption="Secure Boot Key bits 255:224" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_28" offset="0x70" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 28">
          <bitfield name="BOOTROM_UDS_0" caption="DICE UDS Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_29" offset="0x74" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 29">
          <bitfield name="BOOTROM_UDS_1" caption="DICE UDS Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_30" offset="0x78" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 30">
          <bitfield name="BOOTROM_UDS_2" caption="DICE UDS Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_31" offset="0x7C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 31">
          <bitfield name="BOOTROM_UDS_3" caption="DICE UDS Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_32" offset="0x80" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 32">
          <bitfield name="BOOTROM_UDS_4" caption="DICE UDS Key bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_33" offset="0x84" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 33">
          <bitfield name="BOOTROM_UDS_5" caption="DICE UDS Key bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_34" offset="0x88" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 34">
          <bitfield name="BOOTROM_UDS_6" caption="DICE UDS Key bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_35" offset="0x8C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 35">
          <bitfield name="BOOTROM_UDS_7" caption="DICE UDS Key bits 255:224" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_56" offset="0xE0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 56">
          <bitfield name="BOOTROM_BOCORHASH_0" caption="Boot Configuration Row Hash bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_57" offset="0xE4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 57">
          <bitfield name="BOOTROM_BOCORHASH_1" caption="Boot Configuration Row Hash bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_58" offset="0xE8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 58">
          <bitfield name="BOOTROM_BOCORHASH_2" caption="Boot Configuration Row Hash bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_59" offset="0xEC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 59">
          <bitfield name="BOOTROM_BOCORHASH_3" caption="Boot Configuration Row Hash bits 127:96" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_60" offset="0xF0" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 60">
          <bitfield name="BOOTROM_BOCORHASH_4" caption="Boot Configuration Row Hash bits 159:128" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_61" offset="0xF4" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 61">
          <bitfield name="BOOTROM_BOCORHASH_5" caption="Boot Configuration Row Hash bits 191:160" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_62" offset="0xF8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 62">
          <bitfield name="BOOTROM_BOCORHASH_6" caption="Boot Configuration Row Hash bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_63" offset="0xFC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 63">
          <bitfield name="BOOTROM_BOCORHASH_7" caption="Boot Configuration Row Hash bits 255:224" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP1_FUSES">
        <register name="OTP1_WORD_0" offset="0x0" rw="R" size="4" caption="OTP1 Page Word 0">
          <bitfield name="BOOTROM_SECEN" caption="Security Enable Fuse" mask="0x400"/>
        </register>
        <register name="OTP1_WORD_1" offset="0x4" rw="R" size="4" caption="OTP1 Page Word 1">
          <bitfield name="BOOTROM_NVMCRC" caption="CRC for NVM DWORD" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP2_FUSES">
        <register name="OTP2_WORD_1" offset="0x4" rw="R" size="4" caption="OTP2 Page Word 1">
          <bitfield name="PM_NVM3VSWDIS" caption="3V NVM switch disable" mask="0x8000"/>
        </register>
      </register-group>
      <register-group name="SW_CALIB_FUSES">
        <register name="SW_CALIB_WORD_0" offset="0x0" rw="R" size="4" caption="SW_CALIB Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="DFLLULP_DIV_PL0" caption="DFLLULP DIV at PL0" mask="0x1C0"/>
          <bitfield name="DFLLULP_DIV_PL2" caption="DFLLULP DIV at PL2" mask="0xE00"/>
          <bitfield name="USB_TRANSN" caption="USB pad Transn calibration" mask="0x1F000"/>
          <bitfield name="USB_TRANSP" caption="USB pad Transp calibration" mask="0x3E0000"/>
          <bitfield name="USB_TRIM" caption="USB pad Trim calibration" mask="0x1C00000"/>
          <bitfield name="DFLL48M_COARSE_CAL" caption="DFLL48M Coarse Calibration" mask="0x7E000000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xB08F4377" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_SULCK" caption="NVM Secure Region Locks" mask="0x7"/>
          <bitfield name="NVMCTRL_NSULCK" caption="NVM Non-Secure Region Locks" mask="0x38"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x1F80"/>
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x2000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0xC000"/>
          <bitfield name="WDT_RUNSTDBY" caption="WDT Run During Standby" mask="0x2000000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFF0BB" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x200"/>
          <bitfield name="IDAU_RXN" caption="RAM is eXecute Never" mask="0x800"/>
          <bitfield name="NVMCTRL_DXN" caption="DATA FLASH is eXecute Never" mask="0x1000"/>
        </register>
