Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/atdf/PIC32CM1216LS00032.atdf
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="PLRDY" caption="Performance Level Ready interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="PLRDY" caption="Performance Level Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Standby Configuration">
          <bitfield name="PDCFG" caption="Power Domain Configuration" mask="0x1" values="PM_STDBYCFG__PDCFG"/>
          <bitfield name="DPGPDSW" caption="Dynamic Power Gating for PDSW" mask="0x10" values="PM_STDBYCFG__DPGPDSW"/>
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for SRAM" mask="0x400"/>
          <bitfield name="BBIASTR" caption="Back Bias for Trust RAM" mask="0x1000"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU, AHBx, and APBx clocks are OFF" value="2"/>
        <value name="STANDBY" caption="ALL clocks are OFF, unless requested by sleepwalking peripheral" value="4"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_PLCFG__PLSEL">
        <value name="PL0" caption="Performance Level 0" value="0x0"/>
        <value name="PL2" caption="Performance Level 2" value="0x2"/>
      </value-group>
      <value-group name="PM_PWCFG__RAMPSWC">
        <value name="SIZE0" caption="SRAM Retention: 64KB (512KB Flash), 32KB (256KB Flash), 16KB (128KB Flash)" value="0x0"/>
        <value name="SIZE1" caption="SRAM Retention: 48KB (512KB Flash), 32KB (256KB Flash), 12KB (128KB Flash)" value="0x1"/>
        <value name="SIZE2" caption="SRAM Retention: 32KB (512KB Flash), 32KB (256KB Flash), 8KB (128KB Flash)" value="0x2"/>
        <value name="SIZE3" caption="SRAM Retention: 16KB (512KB Flash), 16KB (256KB Flash), 4KB (128KB Flash)" value="0x3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__DPGPDSW">
        <value name="DISABLED" caption="Dynamic Power Gating disabled" value="0"/>
        <value name="ENABLED" caption="Dynamic Power Gating enabled" value="1"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="PDSW power domain switching is handled by hardware." value="0"/>
        <value name="PDSW" caption="PDSW is forced ACTIVE." value="1"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="3.1.0" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="PORT Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="PORT Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="PORT Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x400000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing" mask="0xF000000"/>
          <bitfield name="WRPMUX" caption="Write PMUX" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Input Control">
          <bitfield name="PID0" caption="PORT Event Pin Identifier 0" mask="0x1F"/>
          <bitfield name="EVACT0" caption="PORT Event Action 0" mask="0x60" values="PORT_EVCTRL__EVACT0"/>
          <bitfield name="PORTEI0" caption="PORT Event Input Enable 0" mask="0x80"/>
          <bitfield name="PID1" caption="PORT Event Pin Identifier 1" mask="0x1F00"/>
          <bitfield name="EVACT1" caption="PORT Event Action 1" mask="0x6000"/>
          <bitfield name="PORTEI1" caption="PORT Event Input Enable 1" mask="0x8000"/>
          <bitfield name="PID2" caption="PORT Event Pin Identifier 2" mask="0x1F0000"/>
          <bitfield name="EVACT2" caption="PORT Event Action 2" mask="0x600000"/>
          <bitfield name="PORTEI2" caption="PORT Event Input Enable 2" mask="0x800000"/>
          <bitfield name="PID3" caption="PORT Event Pin Identifier 3" mask="0x1F000000"/>
          <bitfield name="EVACT3" caption="PORT Event Action 3" mask="0x60000000"/>
          <bitfield name="PORTEI3" caption="PORT Event Input Enable 3" mask="0x80000000"/>
        </register>
